from player import PLAYER
from random import *
def generate_player_1():
    name_of_players = ["Aлександр","Михаил","Иван","Сергей","Андрей","Дмитрий","Павел","Алексей","Евгений","Денис","Олег","Владимир","Николай","Григорий","Константин","Виктор","Максим","Артем","Роман","Юрий","Игорь","Василий","Степан","Владислав","Геннадий","Илья","Тимофей","Борис","Валентин","Марк","Валерий","Егор","Леонид","Кирилл","Богдан","Анатолий","Всеволод","Артур","Федор","Антон","Арсений","Владлен","Викторий","Всеволод","Станислав","Ефим","Евграф","Алексей","Вадим","Давид","Даниил","Аркадий","Владислав","Елисей","Захар","Игнат","Леон","Слим","Нмим","Руслан","Семен","Станислав","Филипп","Ярослав","Юлиан","Яков","Ян","Ярослав","Ананий","Август","Адриан","Аркадий","Антуан","Бенедикт","Бронислав","Богдан","Виталий","Владлен","Валентин","Георгий","Глеб","Геннадий","Демид","Даниил","Дамир","Эдуард","Ефим","Зенон","Кондрат","Мстислав","Мирон","Никита","Назар","Онисим","Петр","Прохор","Родинон","Ростислав","Савелий","Степан"]
    player_1 = PLAYER(round(uniform(0.1, 1), 3), round(randint(15, 25), 3), round(uniform(0.1, 1), 3), name_of_players[randint(0, len(name_of_players) - 1)])
    return(player_1)



